project-chip/connectedhomeip/examples/lock-app/nrf5/main/AppTask.cpp
        case SoftwareUpdateManager::kEvent_FetchPartialImageInfo:
        {
            NRF_LOG_INFO("Fetching Partial Image Information");
            if (strcmp(aInParam.FetchPartialImageInfo.URI, persistedImageURI) == 0)
            {
                NRF_LOG_INFO("Partial image detected in local storage; resuming download at offset %" PRId32, persistedImageLen);
                aOutParam.FetchPartialImageInfo.PartialImageLen = persistedImageLen;
            }
            else
            {
                NRF_LOG_INFO("No partial image detected in local storage");
                aOutParam.FetchPartialImageInfo.PartialImageLen = 0;
            }
            break;
        }

        case SoftwareUpdateManager::kEvent_PrepareImageStorage:
        {
            NRF_LOG_INFO("Preparing Image Storage");

            // Capture state information about the image being downloaded.
            persistedImageLen = 0;
            strncpy(persistedImageURI, aInParam.PrepareImageStorage.URI, sizeof(persistedImageURI));
            persistedImageURI[sizeof(persistedImageURI) - 1] = 0;

            // Prepare to compute the integrity of the image as it is received.
            //
            // This example does not actually store image blocks in persistent storage and merely discards
            // them after computing the SHA over it. As a result, integrity has to be computed as the image
            // blocks are received, rather than over the entire image at the end. This pattern is NOT
            // recommended since the computed integrity will be lost if the device rebooted during download.
            //
            sSHA256.Begin();

            // Tell the SoftwareUpdateManager that storage preparation has completed.
            SoftwareUpdateMgr().PrepareImageStorageComplete(WEAVE_NO_ERROR);
            break;
        }

        case SoftwareUpdateManager::kEvent_StartImageDownload:
        {
            NRF_LOG_INFO("Starting Image Download");
            break;
        }
        case SoftwareUpdateManager::kEvent_StoreImageBlock:
        {
            sSHA256.AddData(aInParam.StoreImageBlock.DataBlock, aInParam.StoreImageBlock.DataBlockLen);
            persistedImageLen += aInParam.StoreImageBlock.DataBlockLen;
            NRF_LOG_INFO("Image Download: %" PRId32 " bytes received", persistedImageLen);
            break;
        }

        case SoftwareUpdateManager::kEvent_ComputeImageIntegrity:
        {
            NRF_LOG_INFO("Computing image integrity");
            NRF_LOG_INFO("Total image length: %" PRId32, persistedImageLen);

            // Make sure that the buffer provided in the parameter is large enough.
            if (aInParam.ComputeImageIntegrity.IntegrityValueBufLen < sSHA256.kHashLength)
            {
                aOutParam.ComputeImageIntegrity.Error = WEAVE_ERROR_BUFFER_TOO_SMALL;
            }
            else
            {
                sSHA256.Finish(aInParam.ComputeImageIntegrity.IntegrityValueBuf);
            }
            break;
        }

        case SoftwareUpdateManager::kEvent_ResetPartialImageInfo:
        {
            // Reset the "persistent" state information related to the image being downloaded,
            // This ensures that the image will be re-downloaded in its entirety during the next
            // software update attempt.
            persistedImageLen = 0;
            persistedImageURI[0] = '\0';
            break;
        }

        case SoftwareUpdateManager::kEvent_ReadyToInstall:
        {
            NRF_LOG_INFO("Image is ready to be installed");
            break;
        }

        case SoftwareUpdateManager::kEvent_StartInstallImage:
        {
            AppTask *_this = static_cast<AppTask*>(apAppState);

            NRF_LOG_INFO("Image Install is not supported in this example application");

            AppEvent event;
            event.Type             = AppEvent::kEventType_Install;
            event.Handler          = InstallEventHandler;
            _this->PostEvent(&event);

            break;
        }

        case SoftwareUpdateManager::kEvent_Finished:
        {
            if (aInParam.Finished.Error == WEAVE_ERROR_NO_SW_UPDATE_AVAILABLE)
            {
                NRF_LOG_INFO("No Software Update Available");
            }
            else if (aInParam.Finished.Error == WEAVE_DEVICE_ERROR_SOFTWARE_UPDATE_IGNORED)
            {
                NRF_LOG_INFO("Software Update Ignored by Application");
            }
            else if (aInParam.Finished.Error == WEAVE_DEVICE_ERROR_SOFTWARE_UPDATE_ABORTED)
            {
                NRF_LOG_INFO("Software Update Aborted by Application");
            }
            else if (aInParam.Finished.Error != WEAVE_NO_ERROR || aInParam.Finished.StatusReport != NULL)
            {
                if (aInParam.Finished.Error == WEAVE_ERROR_STATUS_REPORT_RECEIVED)
                {
                    NRF_LOG_INFO("Software Update failed: Received StatusReport %s",
                                 nl::StatusReportStr(aInParam.Finished.StatusReport->mProfileId,
                                                     aInParam.Finished.StatusReport->mStatusCode));
                }
                else
                {
                    NRF_LOG_INFO("Software Update failed: %s", nl::ErrorStr(aInParam.Finished.Error));
                }
            }
            else
            {
                NRF_LOG_INFO("Software Update Completed");

                // Reset the "persistent" image state information.  Since we don't actually apply the
                // downloaded image, this ensures that the next software update attempt will re-download
                // the image.
                persistedImageLen = 0;
                persistedImageURI[0] = '\0';
            }
            break;
        }

        default:
            nl::Weave::DeviceLayer::SoftwareUpdateManager::DefaultEventHandler(apAppState, aEvent, aInParam, aOutParam);
            break;
    }
}
